app/controllers/v1/distances_controller.rb

  def create
    distance = Distance.find_or_initialize_by(distance_key_params)
    distance.assign_attributes(distance_params)
    if distance.save
---
UPDATE "distances" SET "distance" = $1, "updated_at" = $2 WHERE "distances"."id" = $3  [["distance", 387], ["updated_at", "2018-05-01 20:27:36.231442"], ["id", 1]]